zingo/esp32jtag_firmware/main/main.c
    ESP_LOGI(TAG, "Configuring FPGA, bin file size=%ld", sz);

    uint8_t cfg_stat;
    int8_t retry = 3;
    while ((cfg_stat = ICE_FPGA_Config(bitstream_bin_start, sz)) && (--retry)) {
        ESP_LOGW(TAG, "FPGA configured ERROR - status = %d retry=%d", cfg_stat, retry);
    }
    if (retry)
        ESP_LOGI(TAG, "FPGA configured OK - status = %d retry=%d", cfg_stat, retry);
    else
        ESP_LOGW(TAG, "FPGA configured ERROR - giving up");

    return ESP_OK;
}

#define SPI_MAX_TRANSFER_BYTES  4096
#define SPI_CLK_MHZ             (20*1000*1000)
#define INITIAL_VIO_DUTY        8   /* 8/1024 → ~3.30V output */

#if AEL_BOARD_HAS_TARGET_VIO_PWM
/* PWM duty values for Target IO Voltage UI options (index matches HTML option value):
 *   0 = 3.3V -> duty   8
 *   1 = 2.5V -> duty 123
 *   2 = 1.8V -> duty 228
 *   3 = 1.5V -> duty 271
 *   4 = 1.2V -> duty 318
 * Derived from empirical measurements on ESP32JTAG v1.3/v1.4 hardware.
 * Default (fresh flash / factory reset) is index 0 = 3.3V. */
static const uint16_t vio_duty_table[] = { 8, 123, 228, 271, 318 };
#define VIO_DUTY_TABLE_SIZE  (sizeof(vio_duty_table) / sizeof(vio_duty_table[0]))
#endif

static spi_device_handle_t spi_device_1_manual_handle;
static spi_device_handle_t spi_device_2_hw_handle;
static spi_device_handle_t spi_device_3_hw_handle;
static spi_device_handle_t spi_device_4_hw_handle;
esp_err_t spi_master_init(void){
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "SPI/FPGA fabric init skipped for board '%s'", g_board->name);
        return ESP_OK;
    }
    ESP_LOGI(TAG, "Doing spi_master_init()");


    // 1. Bus configuration (same for all devices on this bus)
    spi_bus_config_t buscfg = {
        .mosi_io_num = PIN_NUM_MOSI,
        .miso_io_num = PIN_NUM_MISO,
        .sclk_io_num = PIN_NUM_CLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = SPI_MAX_TRANSFER_BYTES
    };

    // Initialize the bus
    //esp_err_t ret = spi_bus_initialize(SPI_HOST_USED, &buscfg, SPI_DMA_CH_AUTO);
    esp_err_t ret = spi_bus_initialize(XVC_SPI_HOST, &buscfg, SPI_DMA_CH_AUTO);
    //esp_err_t ret = spi_bus_initialize(XVC_SPI_HOST, &buscfg, SPI_DMA_DISABLED);
    if (ret != ESP_OK){
        return ret;
    }

    // 2. Device 1 configuration with manual CS control
    spi_device_interface_config_t devcfg_1_manual = {
        //.clock_speed_hz = SPI_CLK_MHZ,
#if USING_ARTIX7_BOARD
        .clock_speed_hz = 26*1000*1000, //
#else
        .clock_speed_hz = 40*1000*1000, //
#endif
        .mode = 0,
        .spics_io_num = -1, // Use -1 for manual control
        //.spics_io_num = PIN_NUM_CS0, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 1 to the bus, getting its unique handle
    //ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_1_manual, &spi_device_1_manual_handle);
    ret = spi_bus_add_device(SPI_HOST_USED, &devcfg_1_manual, &spi_device_1_manual_handle);//using SPI_HOST_USED!!! Same as LCD
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_1_manual failed");
        return ret;
    }
    gbl_spi_h1 = spi_device_1_manual_handle; //spi device for LA capture

    // 3. Device 2 configuration with hardware CS control
    spi_device_interface_config_t devcfg_2_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS1, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 2 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_2_hw, &spi_device_2_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_2_hw failed");
        return ret;
    }

    // 4. Device 3 configuration with hardware CS control
    spi_device_interface_config_t devcfg_3_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS2, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 3 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_3_hw, &spi_device_3_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_3_hw failed");
        return ret;
    }
    ESP_LOGI(TAG, "spi_bus_add_device devcfg_3_hw OK!");

    // 5. Device 4 configuration with hardware CS control
    spi_device_interface_config_t devcfg_4_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS3, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 4 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_4_hw, &spi_device_4_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_4_hw failed");
        return ret;
    }
    ESP_LOGI(TAG, "spi_bus_add_device devcfg_4_hw OK!");

    // 6. Manually configure the CS pin for Device 1 as a GPIO output
    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = ael_gpio_mask_if_valid(PIN_NUM_CS0);
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 0;
    if (io_conf.pin_bit_mask != 0) {
        gpio_config(&io_conf);
        gpio_set_level(PIN_NUM_CS0, 1); //Assert CS by default
    }

    ESP_LOGI(TAG, "spi_master_init() done, gbl_spi_h1 is %s.", gbl_spi_h1==NULL? "NULL":"Not NULL"); 
    return ret;
}
esp_err_t spi_comm_with_device_0(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    spi_transaction_t t = {
        .length = length * 8,          // length in **bits**
        .tx_buffer = tx_data,
        .rx_buffer = rx_data,
    };

    gpio_set_level(PIN_NUM_CS0, 0); // Manual CS assert
    esp_err_t ret = spi_device_transmit(spi_device_1_manual_handle, &t);
    gpio_set_level(PIN_NUM_CS0, 1); // Manual CS de-assert
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SPI transfer failed: %s", esp_err_to_name(ret));
    } else {
        //ESP_LOGI(TAG, "Transfer successful. len=%d",length);
    }
    return  ret;
}

// Define a type for the SPI device handle for clarity
typedef spi_device_handle_t spi_handle_t;

/**
 * @brief Transfers data over SPI for a specified device.
 *
 * @param device_handle The handle of the SPI device to use (e.g., spi_device_2_hw_handle).
 * @param tx_data Pointer to the transmit buffer.
 * @param rx_data Pointer to the receive buffer (or NULL if not needed).
 * @param length The length of the data in bytes.
 * @return esp_err_t ESP_OK on success, or an error code on failure.
 */
esp_err_t spi_transfer_data(spi_handle_t device_handle, const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    // 1. Prepare the SPI transaction structure
    spi_transaction_t t = {
        // 'length' is in bytes, but the SPI function expects length in **bits**
        .length = length * 8,
        .tx_buffer = tx_data,
        .rx_buffer = rx_data,
    };

    // 2. Transmit the data using the specified device handle
    esp_err_t ret = spi_device_transmit(device_handle, &t);

    // 3. Check for errors and log if necessary
    if (ret != ESP_OK) {
        // Use a generic error log, as the device is now dynamic
        ESP_LOGE(TAG, "SPI transfer failed: %s", esp_err_to_name(ret));
    }
    // You can keep the successful transfer log commented out or remove it
    /* else {
        //ESP_LOGI(TAG, "Transfer successful. len=%d", length);
    } */

    return ret;
}

// Helper wrappers for compatibility and cleaner usage in other parts of the code
esp_err_t spi_device2_transfer_data(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    return spi_transfer_data(spi_device_2_hw_handle, tx_data, rx_data, length);
}

