zingo/esp32jtag_firmware/main/main.c
esp_err_t spi_device3_transfer_data(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    return spi_transfer_data(spi_device_3_hw_handle, tx_data, rx_data, length);
}

esp_err_t spi_device4_transfer_data(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    return spi_transfer_data(spi_device_4_hw_handle, tx_data, rx_data, length);
}
void set_gpio_high_z(gpio_num_t gpio_num)
{
    // Configure as input
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << gpio_num,
        .mode = GPIO_MODE_INPUT,      // Input mode = high-impedance
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&io_conf);
}

extern void gdb_application_thread(void *pvParameters);


/* Read a uint8 from NVS by key. On miss, writes default and uses it. */
static void load_nvs_uint8(const char *key, uint8_t *out, uint8_t default_val)
{
    char *val = NULL;
    if (storage_alloc_and_read(key, &val) == ESP_OK && val) {
        *out = (uint8_t)atoi(val);
        free(val);
    } else {
        *out = default_val;
        char buf[4];
        snprintf(buf, sizeof(buf), "%d", default_val);
        storage_write(key, buf, strlen(buf) + 1);
        ESP_LOGI(TAG, "Saved default %s=%d to NVS", key, default_val);
    }
}

static void load_port_configurations(void)
{
    load_nvs_uint8(PORT_A_CFG_KEY, &gbl_pa_cfg, DEFAULT_PA_CFG);
    load_nvs_uint8(PORT_B_CFG_KEY, &gbl_pb_cfg, DEFAULT_PB_CFG);
    load_nvs_uint8(PORT_C_CFG_KEY, &gbl_pc_cfg, DEFAULT_PC_CFG);
    load_nvs_uint8(PORT_D_CFG_KEY, &gbl_pd_cfg, DEFAULT_PD_CFG);
    gbl_pd_display_cfg = gbl_pd_cfg;

    // uart_port_sel is 'char', handled separately
    char *val = NULL;
    if (storage_alloc_and_read(UART_PORT_SEL_KEY, &val) == ESP_OK && val) {
        g_app_params.uart_port_sel = (uint8_t)atoi(val);
        free(val);
    } else {
        g_app_params.uart_port_sel = 1;  /* default: web terminal */
        storage_write(UART_PORT_SEL_KEY, "1", 2);
        ESP_LOGI(TAG, "Saved default UART_PORT_SEL=1 to NVS");
    }

    ESP_LOGI(TAG, "Port A Config: %s", get_port_a_description_int(gbl_pa_cfg));
    ESP_LOGI(TAG, "Port B Config: %s", get_port_b_description_int(gbl_pb_cfg));
    ESP_LOGI(TAG, "Port C Config: %s", get_port_c_description_int(gbl_pc_cfg));
    ESP_LOGI(TAG, "Port D Config: %s", get_port_d_description_int(gbl_pd_cfg));

    // USB CMSIS-DAP state is fixed until reboot, cache it to avoid NVS reads
    // in the 200 ms LCD redraw loop.
    char *dap_val = NULL;
    if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &dap_val) == ESP_OK && dap_val) {
        gbl_usb_dap_enabled = (strcmp(dap_val, "1") != 0);
        free(dap_val);
    } else {
        gbl_usb_dap_enabled = false;
    }
}

/* Load AP SSID and password from NVS, generating a unique SSID on first boot. */
static void load_ap_params(void)
{
    char *ap_ssid = NULL;
    if (storage_alloc_and_read(WIFI_AP_SSID_KEY, &ap_ssid) == ESP_OK && ap_ssid) {
        strncpy(g_app_params.wifi_ssid, ap_ssid, sizeof(g_app_params.wifi_ssid) - 1);
        g_app_params.wifi_ssid[sizeof(g_app_params.wifi_ssid) - 1] = '\0';
        free(ap_ssid);
    } else {
        // Fallback to default with MAC suffix for uniqueness
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_WIFI_SOFTAP);
        char unique_ssid[32];
        snprintf(unique_ssid, sizeof(unique_ssid), "%s_%02X%02X", WIFI_AP_SSSID, mac[4], mac[5]);
        strcpy(g_app_params.wifi_ssid, unique_ssid);
        storage_write(WIFI_AP_SSID_KEY, unique_ssid, strlen(unique_ssid));
        ESP_LOGI(TAG, "Saved default Unique AP SSID to NVS: %s", unique_ssid);
    }

    char *ap_pass = NULL;
    if (storage_alloc_and_read(WIFI_AP_PASS_KEY, &ap_pass) == ESP_OK && ap_pass) {
        strncpy(g_app_params.wifi_pass, ap_pass, sizeof(g_app_params.wifi_pass) - 1);
        g_app_params.wifi_pass[sizeof(g_app_params.wifi_pass) - 1] = '\0';
        free(ap_pass);
    } else {
        strcpy(g_app_params.wifi_pass, WIFI_AP_PASSW);
        storage_write(WIFI_AP_PASS_KEY, WIFI_AP_PASSW, strlen(WIFI_AP_PASSW));
        ESP_LOGI(TAG, "Saved default AP Password to NVS");
    }
}

/*
 * Load WiFi network parameters from NVS.
 * If WIFI_MODE_KEY is missing (first boot), defaults to AP mode.
 * If menuconfig has user values and NVS has no SSID, uses STA mode.
 */
static void load_network_params(void) {
    // SINGLE SOURCE OF TRUTH: Read WIFI_MODE_KEY ("SM" or "AP")
    char *wifi_mode_str = NULL;
    bool is_sta_mode = false;

    if (storage_alloc_and_read(WIFI_MODE_KEY, &wifi_mode_str) == ESP_OK && wifi_mode_str) {
        if (strcmp(wifi_mode_str, "SM") == 0) {
            is_sta_mode = true;
        }
        ESP_LOGI(TAG, "Read WIFI_MODE_KEY: %s, setting mode to %s", wifi_mode_str, is_sta_mode ? "STA" : "AP");
        free(wifi_mode_str);
    } else {
        // Default to AP if key is missing (first boot)
        ESP_LOGW(TAG, "WIFI_MODE_KEY not found. Defaulting to AP Mode and saving to NVS.");
        is_sta_mode = false;
        storage_write(WIFI_MODE_KEY, "AP", 2);
    }

    size_t ssid_len = storage_get_value_length(WIFI_SSID_KEY);
    ESP_LOGI(TAG, "ssid_len:%d", ssid_len);

    if (!is_sta_mode) {
        ESP_LOGW(TAG, "Activating AP mode!");
        g_app_params.mode = APP_MODE_AP;
        load_ap_params();
    }
    else {
        if (ssid_len == 0) {
            ESP_LOGW(TAG, "Failed to get WiFi SSID len from nvs.");
            if (!strcmp(CONFIG_ESP_WIFI_SSID, WIFI_AP_SSSID)) {
                ESP_LOGW(TAG, "Default values read from menuconfig. AP mode will be activated!");
                g_app_params.mode = APP_MODE_AP;
                strcpy(g_app_params.wifi_ssid, WIFI_AP_SSSID);
                strcpy(g_app_params.wifi_pass, WIFI_AP_PASSW);
            } else {
                ESP_LOGW(TAG, "User values read from menuconfig. STA mode will be activated!");
                g_app_params.mode = APP_MODE_STA;
                strcpy(g_app_params.wifi_ssid, CONFIG_ESP_WIFI_SSID);
                strcpy(g_app_params.wifi_pass, CONFIG_ESP_WIFI_PASSWORD);
            }
        } else {
            g_app_params.mode = APP_MODE_STA;
            esp_err_t err = storage_read(WIFI_SSID_KEY, g_app_params.wifi_ssid, ssid_len);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to read WiFi ssid");
            } else {
                size_t pass_len = storage_get_value_length(WIFI_PASS_KEY);
                if (pass_len == 0) {
                    ESP_LOGW(TAG, "Failed to get WiFi password len");
                } else {
                    err = storage_read(WIFI_PASS_KEY, g_app_params.wifi_pass, pass_len);
                    if (err != ESP_OK) {
                        ESP_LOGW(TAG, "Failed to read WiFi password");
                    }
                }
            }
        }
    }

