zingo/esp32jtag_firmware/main/main.c
    if (g_app_params.mode == APP_MODE_AP) {
        g_app_params.net_adapter_name = "wifiap";
    } else if (g_app_params.mode == APP_MODE_STA) {
        g_app_params.net_adapter_name = "wifista";
    }

    ESP_LOGI(TAG, "app mode (%s)", g_app_params.mode == APP_MODE_AP ? "Access Point" : "Station");
    ESP_LOGI(TAG, "wifi ssid (%s)", g_app_params.wifi_ssid);
    ESP_LOGI(TAG, "wifi pass (%s)", g_app_params.wifi_pass);
}

static void init_idf_components(void) {
    ESP_LOGI(TAG, "Setting up...\n");
    //init_console();
    ESP_ERROR_CHECK(storage_init_filesystem());
    ESP_ERROR_CHECK(nvs_flash_init());
    storage_init_nvs();
    esp_netif_init();
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    char *disable_dap_val = NULL;
    bool disable_usb_dap = true;  /* default: disabled */
    if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &disable_dap_val) == ESP_OK && disable_dap_val) {
        disable_usb_dap = (strcmp(disable_dap_val, "1") == 0);
        free(disable_dap_val);
    }

    if (!disable_usb_dap) {
        chry_dap_init(0, ESP_USBD_BASE);
    } else {
        ESP_LOGI(TAG, "Skipping chry_dap_init because USB DAP is disabled.");
    }
    // Redirect logs to USB CDC
    //esp_log_set_vprintf(usb_log_vprintf);
}

static bool get_ap_ip_str(char *buf, size_t buf_len) {
    if (buf == NULL || buf_len < 16) {
        return false;
    }

    esp_netif_ip_info_t ip_info;
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");

    if (netif == NULL) {
        return false;
    }
    if (esp_netif_get_ip_info(netif, &ip_info) != ESP_OK) {
        return false;
    }

    snprintf(buf, buf_len, IPSTR, IP2STR(&ip_info.ip));
    return true;
}

/*--- ADC Calibration ---*/
static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif
    *out_handle = handle;
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

    return calibrated;
}

/* Voltage scaling constants: vtarget_mV = adc_mV * NUM / DEN */
#define ADC_VTARGET_SCALE_NUM  (34 * 958)
#define ADC_VTARGET_SCALE_DEN  9470

static void AD_CH1_init(void)
{
    int voltage;
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config, &gbl_adc_handle));

    adc_oneshot_chan_cfg_t channel_config = {
        //.bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = ADC_ATTEN_DB_12,  // Allows input voltage up to ~3.3V
        .bitwidth = ADC_BITWIDTH_DEFAULT, //ADC_BITWIDTH_12,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(gbl_adc_handle, ADC_CHANNEL_0, &channel_config));

    bool do_calibration1_chan0 = adc_calibration_init(ADC_UNIT_1, ADC_CHANNEL_0,ADC_ATTEN_DB_12, &adc1_cali_chan0_handle);

    int adc_raw;
    esp_err_t result = adc_oneshot_read(gbl_adc_handle, ADC_CHANNEL_0, &adc_raw);

    if (result == ESP_OK) {
        ESP_LOGI(TAG, "ADC Raw: %d", adc_raw);
        if (do_calibration1_chan0) {
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc1_cali_chan0_handle,adc_raw, &voltage));
            int vtarget = voltage * ADC_VTARGET_SCALE_NUM / ADC_VTARGET_SCALE_DEN;
            ESP_LOGI(TAG, "ADC%d Channel[%d] Cali Voltage: %d mV vtarget=%d mV", ADC_UNIT_1 + 1, ADC_CHANNEL_0, voltage, vtarget);
        }
    } else {
        ESP_LOGE(TAG, "ADC Read Failed");
    }
}

static void setup_pwm1(void)
{
    if (!g_board || !g_board->has_target_vio_pwm) {
        return;
    }

    ledc_timer_config_t ledc_timer1 = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .timer_num = LEDC_TIMER_1,
        //.duty_resolution  = LEDC_TIMER_13_BIT,      // Resolution of PWM duty (2^13 = 8192 levels)
        .duty_resolution = LEDC_TIMER_10_BIT,      // Resolution of PWM duty (2^10 = 1024 levels)
        .freq_hz = 5000,                   // Frequency in Hertz
        .clk_cfg = LEDC_AUTO_CLK
    };
    ledc_timer_config(&ledc_timer1);

    ledc_channel_config_t ledc_channel1 = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = LEDC_CHANNEL_1,
        .timer_sel = LEDC_TIMER_1,
        .intr_type = LEDC_INTR_DISABLE,
        .gpio_num = 16,                       // GPIO where PWM is output
        .duty = 0,                        // Initial duty cycle (0%)
        .hpoint = 0
    };
    ledc_channel_config(&ledc_channel1);
}

static void set_pwm1_duty(uint16_t duty)
{
    if (!g_board || !g_board->has_target_vio_pwm) {
        return;
    }

    // Set brightness
    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1, duty);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1);
}


// Helper to get font width if not defined as macro
// Assuming standard usage as per GUI_Paint.h
#ifndef PAINT_CHAR_WIDTH
#define PAINT_CHAR_WIDTH 12
#endif

static void print_sta_info(void)
{
    wifi_sta_list_t sta_list;
    esp_err_t ret = esp_wifi_ap_get_sta_list(&sta_list);

