zingo/esp32jtag_firmware/main/main.c
    static int prev_num_stations = -1;  /* Retain last LCD state across calls */
    static int prev_rssi = 1;           /* Retain last LCD state across calls */

    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Number of connected stations: %d", sta_list.num);

        int current_rssi = 0;
        if(sta_list.num > 0){
             current_rssi = sta_list.sta[0].rssi;
        }

        // Update LCD if changed
        if (sta_list.num != prev_num_stations || (sta_list.num > 0 && current_rssi != prev_rssi)) {
            // Use the line below "AP Mode" to avoid width issues
            int x_pos = X_OFFSET + 7 * PAINT_CHAR_WIDTH;//7: "AP Mode"
            int y_pos = 10;

            if (sta_list.num > 0) {
                // "-29dBm" (Yellow)
                char rssi_buf[16];
                snprintf(rssi_buf, sizeof(rssi_buf), " %ddBm", current_rssi);
                Paint_DrawString_EN(x_pos, y_pos, rssi_buf, &CURR_FONT, BLACK, YELLOW);
                x_pos += strlen(rssi_buf) * PAINT_CHAR_WIDTH;

                // "1 Connection" (Green)
                char conn_buf[32];
                snprintf(conn_buf, sizeof(conn_buf), " %d Conn", sta_list.num);
                Paint_DrawString_EN(x_pos, y_pos, conn_buf, &CURR_FONT, BLACK, GREEN);
                x_pos += strlen(conn_buf) * PAINT_CHAR_WIDTH;
            } else {
                 // Clear the line if no connections
                 Paint_DrawString_EN(x_pos, y_pos, "               ", &CURR_FONT, BLACK, BLACK);
            }

            // Clear trailing artifacts
            //Paint_DrawString_EN(x_pos, y_pos, "  ", &CURR_FONT, BLACK, BLACK);

            prev_num_stations = sta_list.num;
            prev_rssi = current_rssi;
        }

        for (int i = 0; i < sta_list.num; i++) {
            wifi_sta_info_t sta = sta_list.sta[i];
            ESP_LOGI(TAG, "STA %d: MAC=%02X:%02X:%02X:%02X:%02X:%02X, RSSI=%d dBm",
                     i + 1,
                     sta.mac[0], sta.mac[1], sta.mac[2],
                     sta.mac[3], sta.mac[4], sta.mac[5],
                     sta.rssi);
        }
    } else {
        ESP_LOGE(TAG, "Failed to get STA list: %s", esp_err_to_name(ret));
    }
}
esp_err_t set_cfga(bool use_porta, bool use_portb, bool use_portc, bool use_portd, bool njtag_swdio, bool swd_gpio){
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_cfga skipped on board '%s'", g_board->name);
        return ESP_OK;
    }
    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;

    global_data_reg_0 &= ~(CFGPA | CFGPB | CFGPC | CFGPD);

    if(use_porta) {
        global_data_reg_0 |= CFGPA;
    }
    if(use_portb) {
        global_data_reg_0 |= CFGPB;
    }
    if(use_portc) {
        global_data_reg_0 |= CFGPC;
    }
    if(use_portd) {
        global_data_reg_0 |= CFGPD;
    }

    if(njtag_swdio){
        global_data_reg_0 |= NJTAG_SWDIO;
    }
    else{
        global_data_reg_0 &= ~NJTAG_SWDIO;
    }
    if(swd_gpio){
        global_data_reg_0 |= SWD_GPIO;
    }
    else{
        global_data_reg_0 &= ~SWD_GPIO;
    }

    tx[1] = global_data_reg_0;
    ESP_LOGI(TAG, "set_cfga: global_data_reg_0=0x%02x use_porta/b/c/d=%d %d %d %d, jtag_swdio=%d, swd_gpio=%d", 
            global_data_reg_0, use_porta, use_portb, use_portc, use_portd, njtag_swdio, swd_gpio);

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
esp_err_t set_la_input_sel(bool use_test_signal)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_la_input_sel skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;
    if(use_test_signal) {
        global_data_reg_0 |= LA_INPUT_SEL;//use internal cnt1 as LA input
    }
    else{
        global_data_reg_0 &= ~LA_INPUT_SEL;
    }
    tx[1] = global_data_reg_0;

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
/* Assert (true) or deassert (false) the SRESET signal on Port B pin3.
 * Port B must be configured as PB_UART_SRESET_VTARGET for the signal
 * to physically appear on the connector. */
esp_err_t set_sreset(bool assert_reset)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_sreset skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;
    /* Convert the logical reset state to the configured electrical level. */
    const bool output_high = gbl_sreset_polarity ? !assert_reset : assert_reset;
    if (output_high) {
        global_data_reg_0 |= SRESET;
    } else {
        global_data_reg_0 &= ~SRESET;
    }
    tx[1] = global_data_reg_0;
    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "set_sreset(asserted=%d, level=%s): global_data_reg_0=0x%02x",
             assert_reset, output_high ? "HIGH" : "LOW", global_data_reg_0);
    return ret1;
}

bool sreset_is_asserted(void)
{
    const bool output_high = (global_data_reg_0 & SRESET) != 0;
    return gbl_sreset_polarity ? !output_high : output_high;
}

/* Control Port D (P3) signal output via data_reg_1 outsig_sel field.
 * Requires cfgpd=0 (Port D in Logic Analyzer / non-XVC mode).
 *
 * mode:
 *   0 = PORTD_OUT_TRISTATE   — Port D pins tristate (LA input, default)
 *   1 = PORTD_OUT_COUNTER_LO — drive cnt1[3:0]  (132 MHz free-running counter low nibble)
 *   2 = PORTD_OUT_COUNTER_HI — drive cnt1[7:4]  (counter high nibble)
 *   3 = PORTD_OUT_GPIO       — drive data_reg_1[3:0] directly (value = 0..15)
 */
esp_err_t set_portd_output(uint8_t mode, uint8_t value)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_portd_output skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret;
    uint8_t tx[3] = {0, 0, 0};
    uint8_t rx[3] = {0};

