zingo/esp32jtag_firmware/main/main.c
    /* outsig_sel → bits [5:4]; gpio_output_data → bits [3:0]; bit [6] untouched */
    global_data_reg_1 &= ~0x3F;                    /* clear bits [5:0] */
    global_data_reg_1 |= (mode & 0x3) << 4;        /* set outsig_sel */
    if (mode == 3) {
        global_data_reg_1 |= (value & 0xF);        /* set gpio_output_data */
    }

    tx[0] = global_data_reg_1 | 0x80;              /* write flag */
    tx[1] = global_data_reg_0;
    ret = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "set_portd_output: mode=%d val=%d data_reg_1=0x%02x", mode, value, global_data_reg_1);
    return ret;
}

/* ── Port D frequency toggle ──────────────────────────────────────────────
 * Drives Port D (P3) pins 0-3 as a square wave (0x00 ↔ 0x0F) using
 * esp_timer.  freq_hz=0 stops the timer and tristates Port D.
 * Valid non-zero values: 125, 250, 500, 1000 Hz.
 */
static esp_timer_handle_t s_portd_toggle_timer = NULL;
static volatile uint8_t   s_portd_toggle_state = 0;

static void portd_toggle_cb(void *arg)
{
    s_portd_toggle_state ^= 1;
    set_portd_output(PORTD_OUT_GPIO, s_portd_toggle_state ? 0x0F : 0x00);
}

esp_err_t set_portd_freq(uint32_t freq_hz)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_portd_freq skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    if (s_portd_toggle_timer) {
        esp_timer_stop(s_portd_toggle_timer);
        esp_timer_delete(s_portd_toggle_timer);
        s_portd_toggle_timer = NULL;
    }
    if (freq_hz == 0) {
        return set_portd_output(PORTD_OUT_TRISTATE, 0);
    }
    uint64_t half_us = 1000000ULL / (2ULL * freq_hz);
    esp_timer_create_args_t args = {
        .callback        = portd_toggle_cb,
        .arg             = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name            = "portd_tog",
    };
    esp_err_t ret = esp_timer_create(&args, &s_portd_toggle_timer);
    if (ret != ESP_OK) return ret;
    s_portd_toggle_state = 0;
    return esp_timer_start_periodic(s_portd_toggle_timer, half_us);
}

bool gbl_sw2_gpio48_flag = false;
static bool g_force_dbg_redraw = false;
static uint8_t g_lcd_screen = 0;  /* 0=main, 1=pinout */

void check_sw1_sw2(void)
{
    static uint8_t L0 = 1, L48 = 1;    /* Previous GPIO levels, default high (unpressed) */
    static int debug_counter = 0;

    int level_0 = ael_board_has_valid_gpio(PIN_PUSHBUTTON_BOOT_SW1) ? gpio_get_level(PIN_PUSHBUTTON_BOOT_SW1) : -1;
    int level_48 = ael_board_has_valid_gpio(PIN_PUSHBUTTON_SW2) ? gpio_get_level(PIN_PUSHBUTTON_SW2) : -1;

    /* Debug log every ~6 seconds (30 * 200ms) */
    if (++debug_counter >= 30) {
        debug_counter = 0;
        ESP_LOGI(TAG, "SW1 GPIO%d=%d SW2 GPIO%d=%d screen=%d valid_sw1=%d valid_sw2=%d",
                PIN_PUSHBUTTON_BOOT_SW1, level_0,
                PIN_PUSHBUTTON_SW2, level_48,
                g_lcd_screen,
                ael_board_has_valid_gpio(PIN_PUSHBUTTON_BOOT_SW1),
                ael_board_has_valid_gpio(PIN_PUSHBUTTON_SW2));
    }

    if(L0 != level_0 || L48 != level_48){
        ESP_LOGW(TAG, "BUTTON CHANGE: SW1 GPIO%d=%d (was %d) SW2 GPIO%d=%d (was %d)",
                PIN_PUSHBUTTON_BOOT_SW1, level_0, L0,
                PIN_PUSHBUTTON_SW2, level_48, L48);
        if(L0 != level_0 && level_0 == 0){
            g_lcd_screen = (g_lcd_screen + 1) % 2;
            ESP_LOGW(TAG, "SW1 pressed! screen=%d", g_lcd_screen);
        }
        if(g_board->has_secondary_button && L48 != level_48 && level_48 == 0){
            gbl_sw2_gpio48_flag = !gbl_sw2_gpio48_flag;
            g_lcd_screen = (g_lcd_screen + 1) % 2;
            ESP_LOGW(TAG, "SW2 pressed! screen=%d", g_lcd_screen);
        }
        L0 = level_0;
        L48 = level_48;
    }
}

/* Draw initial WiFi mode/SSID info on LCD before network is up. */
static void draw_wifi_startup_info(void)
{
    if (g_app_params.mode == APP_MODE_AP) {
        char ap_ip_buf[16] = {0};
        get_ap_ip_str(ap_ip_buf, sizeof(ap_ip_buf));
        Paint_DrawString_EN(X_OFFSET, 10, "AP Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 3, "PSWD:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 3, g_app_params.wifi_pass, &CURR_FONT, BLACK, MAGENTA);
    } else {
        Paint_DrawString_EN(X_OFFSET, 10, "ST Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
    }
    // Port row: "PORT XVC:2542 GDB:4242"
    Paint_DrawString_EN(X_OFFSET, 10+24*4, "PORT ", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 5*PAINT_CHAR_WIDTH,  10+24*4, "XVC:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 9*PAINT_CHAR_WIDTH,  10+24*4, "2542", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 13*PAINT_CHAR_WIDTH, 10+24*4, "GDB:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 17*PAINT_CHAR_WIDTH, 10+24*4, "4242", &CURR_FONT, BLACK, MAGENTA);
}

/* Draw PA/PB/PC/PD port configuration on LCD. */
static void draw_port_cfg_info(void)
{
    uint32_t y = 10 + 24*5;
    Paint_DrawString_EN(X_OFFSET, y, "PA:          PB:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y, "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pb_cfg == PB_UART_SRESET_VTARGET) ? "UART" : "LA", &CURR_FONT, BLACK, MAGENTA);

    y += 15;
    Paint_DrawString_EN(X_OFFSET, y, "PC:          PD:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y,
        (gbl_pc_cfg == PC_BMP_SWD_JTAG) ? "SWD/JTAG" : "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pd_cfg == PD_FPGA_XVC) ? "XVC" : "LA", &CURR_FONT, BLACK, MAGENTA);
}

/* Draw JTAG/SWD debug connection status on LCD. */
static void draw_debug_status(void)
{
    if (!g_board->has_lcd || gbl_pc_cfg != PC_BMP_SWD_JTAG)
        return;

    static char prev_status[32] = {0};
    char status[32] = {0};

    bool usb_dap_enabled = gbl_usb_dap_enabled;

    if (usb_dap_enabled) {
        strcpy(status, "DBG: USB CMSIS-DAP");
    } else if (cur_target) {
        if (gdb_target_running)
            strcpy(status, "DBG: Running");
        else
            strcpy(status, "DBG: Halted");
    } else {
        strcpy(status, "DBG: No target");
    }

    if (g_force_dbg_redraw) {
        prev_status[0] = '\0';
        g_force_dbg_redraw = false;
    }

    if (strcmp(prev_status, status) != 0) {
        uint32_t y = 10 + 24*5 + 30;
        char padded[32] = {0};
        snprintf(padded, sizeof(padded), "%-24s", status);
        uint16_t color = usb_dap_enabled ? BLUE :
            (cur_target ? (gdb_target_running ? GREEN : YELLOW) : GRAY);
        Paint_DrawString_EN(X_OFFSET, y, padded, &CURR_FONT, BLACK, color);
        snprintf(prev_status, sizeof(prev_status), "%s", status);
    }
}

