zingo/esp32jtag_firmware/main/main.c
/* Draw pin layout / port mode screen on LCD.
 * Shows wire colors and pin functions for all 4 ports. */
static void clear_screen(void)
{
    // TODO: using a block fill (e.g. Paint_ClearAll) caused the target to crash.
    // This row-by-row space draw works but is slow.  Fix or replace the block-fill
    // approach once the root cause is found.
    for (int i = 0; i < LCD_HEIGHT; i += CURR_FONT.Height)
        Paint_DrawString_EN(0, i, "                              ", &CURR_FONT, BLACK, BLACK);
}

static void draw_pinout_screen(void)
{
    if (!g_board->has_lcd)
        return;

    clear_screen();

    static const char *ports[] = {"PA", "PB", "PC", "PD"};
    static const uint16_t wire_colors[] = {RED, BROWN, GREEN, BLUE};
    int pw = CURR_FONT.Width;

    {
        static const char *volt_labels[] = {"3.3V","2.5V","1.8V","1.5V","1.2V"};
        int idx = gbl_vio_idx;
        if (idx < 0 || idx >= 5) idx = 0;
        char title[32];
        /* leading spaces: LCD has curved corners so corner chars are hard to read */
        snprintf(title, sizeof(title), "  PIN LAYOUT - VIO:%s", volt_labels[idx]);
        Paint_DrawString_EN((LCD_WIDTH - (int)strlen(title) * pw) / 2, 5, title, &CURR_FONT, BLACK, CYAN);
    }
    int y = 5 + 18 + 3;
    static const char *la_pins[4][4] = {
        {"CH0", "CH1",  "CH2", "CH3"},
        {"CH4", "CH5",  "CH6", "CH7"},
        {"CH8", "CH9",  "CH10","CH11"},
        {"CH12","CH13", "CH14","CH15"},
    };
    uint8_t cfgs[] = {gbl_pa_cfg, gbl_pb_cfg, gbl_pc_cfg, gbl_pd_cfg};
    for (int i = 0; i < 4; i++) {
        const char **pin;
        switch (i) {
            case 0: /* PA */
                if (cfgs[i] == PA_LOGICANALYZER)
                    pin = la_pins[0];
                else if (cfgs[i] == PA_BMP_SWD)
                    { static const char *p[] = {"SWCLK","SWDIO","-","-"}; pin = p; }
                else
                    { static const char *p[] = {"TCK","TMS","TDI","TDO"}; pin = p; }
                break;
            case 1: /* PB */
                if (cfgs[i] == PB_LOGICANALYZER)
                    pin = la_pins[1];
                else
                    { static const char *p[] = {"TX","Vtgr","RX","SRst"}; pin = p; }
                break;
            case 2: /* PC */
                if (cfgs[i] == PC_LOGICANALYZER)
                    pin = la_pins[2];
                else
                    { static const char *p[] = {"TDO","TCK","TMS","TDI"}; pin = p; }
                break;
            case 3: /* PD */
                if (cfgs[i] == PD_LOGICANALYZER)
                    pin = la_pins[3];
                else
                    { static const char *p[] = {"TDO","TCK","TMS","TDI"}; pin = p; }
                break;
        }
        int dy = y + 16;
        int x = X_OFFSET;
        char label[5];
        snprintf(label, sizeof(label), "%s:", ports[i]);
        Paint_DrawString_EN(x, dy, label, &CURR_FONT, BLACK, GRAY);
        x += 4 * pw + 3;
        for (int j = 0; j < 4; j++) {
            Paint_DrawString_EN(x, dy, pin[j], &CURR_FONT, BLACK, wire_colors[j]);
            x += 4 * pw + 3;
        }
        if (i == 3) {
            static const char *pd_modes[] = {"LA (input)","FPGA XVC","Counter Lo","Counter Hi","125 Hz","250 Hz","500 Hz","1 kHz"};
            const char *mode = (gbl_pd_display_cfg < 8) ? pd_modes[gbl_pd_display_cfg] : "?";
            int row_w = 5 * (4 * pw + 3);
            int tx = X_OFFSET + (row_w - strlen(mode) * pw) / 2;
            Paint_DrawString_EN(tx, dy + CURR_FONT.Height + 2, mode, &CURR_FONT, BLACK, GRAY);
        }
        y += 47;
    }
}

static void draw_main_screen(void)
{
    if (!g_board->has_lcd)
        return;
    clear_screen();
    draw_wifi_startup_info();
    if (g_app_params.mode == APP_MODE_STA || g_app_params.mode == APP_MODE_AP) {
        char ip_buf[16] = {0};
        if (g_app_params.mode == APP_MODE_STA)
            network_get_my_ip(ip_buf);
        else
            get_ap_ip_str(ip_buf, sizeof(ip_buf));
        Paint_DrawString_EN(X_OFFSET, 10 + 24, "IP:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24, ip_buf, &CURR_FONT, BLACK, MAGENTA);
    }
    draw_port_cfg_info();
    Paint_DrawString_EN(X_OFFSET, LCD_HEIGHT - CURR_FONT.Height - 5, "No hot-plug! Power off", &CURR_FONT, BLACK, RED);
}

/* Start background tasks (GDB, logic analyser, XVC). */
static void start_background_tasks(void)
{
    bool usb_dap_enabled = false;
    {
        char *val = NULL;
        if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &val) == ESP_OK && val) {
            usb_dap_enabled = (strcmp(val, "1") != 0);
            free(val);
        }
    }

    if (gbl_pc_cfg == PC_BMP_SWD_JTAG && !usb_dap_enabled) {
        ESP_LOGI(TAG, "Creating gdb_thread task. gbl_pa_cfg=%d, gbl_pc_cfg=%d", gbl_pa_cfg, gbl_pc_cfg);
        ESP_LOGI(TAG, "Free heap: %u", esp_get_free_heap_size());
        ESP_LOGI(TAG, "To do platform_init() for BMP");
        platform_init();
        ESP_LOGI(TAG, "To do xTaskCreate(&gdb_application_thread) for BMP");
        BaseType_t result = xTaskCreate(&gdb_application_thread, "gdb_thread", 4096, NULL, 15, NULL);
        if (result != pdPASS) {
            ESP_LOGE(TAG, "Failed to create gdb_thread task! Out of memory?");
        }
    } else if (gbl_pc_cfg == PC_BMP_SWD_JTAG && usb_dap_enabled) {
        ESP_LOGI(TAG, "USB CMSIS-DAP enabled — skipping BMP gdb_thread (mutual exclusion)");
    }

    if (g_board->has_logic_analyzer) {
        logic_analyzer_init();
    }

    if (g_board->has_xvc && gbl_pd_cfg == PD_FPGA_XVC) {
        ESP_LOGI(TAG, "To do xTaskCreate(xvc_server_task)");
        xTaskCreate(xvc_server_task, "xvc_server_task", 4096, NULL, 5, NULL);
    }
}

void app_main(void) {

    global_data_reg_0 = 0;
    global_data_reg_1 = 0; // set PC and PD as input
    g_board = ael_board_profile_get();

    esp_log_level_set(TAG, ESP_LOG_INFO);
    ESP_LOGI(TAG, "Board profile: %s", g_board->name);
    init_idf_components();

    console_menu_init();

    gbl_spi_rxbuf = heap_caps_malloc(2048, MALLOC_CAP_DMA);
    assert(gbl_spi_rxbuf);

    capture_start_semaphore = xSemaphoreCreateBinary();
    capture_done_semaphore = xSemaphoreCreateBinary();

#if ESP32JTAG_BOARD
    // esp32jtag v1.3/v1.4 pwm to Vout mapping (approx):
    // 0-->3.36V, 6-->3.32V, 8-->3.30V, 12-->3.27V, 18-->3.23V, 22-->3.20V, 32-->3.13V, 40-->3.03V,
    // 100-->2.65V, 120-->2.52V, 123-->2.50V, 200-->1.99V, 220-->1.85V, 228-->1.80V, 235-->1.75V,
    // 250-->1.66V, 271-->1.50V, 275-->1.48V, 300-->1.33V, 318-->1.20V, 320-->1.19V,
    // 322-->1.18V, 350-->1.00V, 400-->0.66V
    uint16_t pwm1_duty = INITIAL_VIO_DUTY;  /* default: 3.3V when key absent */
    {
        char *volt_str = NULL;
        if (storage_alloc_and_read(TARGET_VOLTAGE_KEY, &volt_str) == ESP_OK && volt_str) {
            int idx = atoi(volt_str);
            free(volt_str);
            if (idx >= 0 && idx < (int)VIO_DUTY_TABLE_SIZE) {
                pwm1_duty = vio_duty_table[idx];
                gbl_vio_idx = (uint8_t)idx;
            }
        }
        /* If key absent (fresh flash or after factory reset): pwm1_duty stays INITIAL_VIO_DUTY = 3.3V */
    }
    ESP_LOGI(TAG, "VIO voltage: pwm1_duty=%u", pwm1_duty);
    setup_pwm1();
    set_pwm1_duty(pwm1_duty);
#endif
    AD_CH1_init();

