zingo/esp32jtag_firmware/main/main.c
    load_network_params();
    load_port_configurations();

    //LCD related starts here ****
    if (g_board->has_lcd) {
        lcd_init();
        lcd_clear(); //clear screen
        Paint_NewImage(LCD_WIDTH, LCD_HEIGHT, 0, BLACK);
    }

    if (g_board->has_fpga) {
        ICE_Init();
        load_fpga();
    }

    if (g_board->has_lcd) {
        draw_wifi_startup_info();
    }

    if (g_app_params.mode == APP_MODE_AP) {
    } else {
        ESP_LOGI(TAG, "Waiting for the network connection...");
    }

    httpd_handle_t http_handle;
    if (web_server_start(&http_handle) != ESP_OK) {
        ESP_LOGE(TAG, "Web server couldn't be started!");
        goto _wait;
    }

    struct network_init_config config = {
        .adapter_name = g_app_params.net_adapter_name,
        .ssid = g_app_params.wifi_ssid,
        .pass = g_app_params.wifi_pass,
        .http_handle = &http_handle
    };

    if (network_start(&config) != ESP_OK) {
         // Fallback logic
        ESP_LOGI(TAG, "Network connection can not be establised. Please check your wifi credentials!");

        // Fallback to AP mode
        if (g_app_params.mode == APP_MODE_STA) {
            ESP_LOGW(TAG, "STA connection failed. Switching to AP Mode fallback.");

            // Save AP mode settings to NVS
            storage_handle_t h;
            if (storage_open_session(&h) == ESP_OK) {
                storage_write_session(h, WIFI_MODE_KEY, "AP", 2);
                storage_close_session(h);
            }
        } else {
            ESP_LOGW(TAG, "Network connection failed!");
        }
        ESP_LOGW(TAG, "Restarting in 3 seconds...");
        vTaskDelay(3000 / portTICK_PERIOD_MS);
        esp_restart();
    }

    //Go on for successful connection
    if (!strcmp(config.adapter_name, "wifiprov")) {
        network_get_sta_credentials(g_app_params.wifi_ssid, g_app_params.wifi_pass);
        storage_write(WIFI_SSID_KEY, g_app_params.wifi_ssid, strlen(g_app_params.wifi_ssid));
        storage_write(WIFI_PASS_KEY, g_app_params.wifi_pass, strlen(g_app_params.wifi_pass));

        ESP_LOGI(TAG, "Wifi credentials have been changed. Restarting in 2 seconds...");
        vTaskDelay(2000 / portTICK_PERIOD_MS);
        esp_restart();
    }

    network_get_my_ip(g_app_params.my_ip);

    // **** IP address display for STA mode goes here ****
    if (g_board->has_lcd) {
        if (g_app_params.mode == APP_MODE_STA) {
            Paint_DrawString_EN(X_OFFSET, 10 + 24, "IP:", &CURR_FONT, BLACK, YELLOW);
            Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24, g_app_params.my_ip, &CURR_FONT, BLACK, MAGENTA);
        } else if (g_app_params.mode == APP_MODE_AP) {
            char ap_ip_buf[16] = {0};
            get_ap_ip_str(ap_ip_buf, sizeof(ap_ip_buf));
            Paint_DrawString_EN(X_OFFSET, 10 + 24, "IP:", &CURR_FONT, BLACK, YELLOW);
            Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24, ap_ip_buf, &CURR_FONT, BLACK, MAGENTA);
        }
    }

    esp_err_t ret_spi = ESP_OK;
    if(gbl_spi_h1 == NULL){
        ret_spi = spi_master_init();
        if (ret_spi != ESP_OK) {
            ESP_LOGE(TAG, "SPI init failed: %s", esp_err_to_name(ret_spi));
        }
    }

    // SPI mode for SWD/JTAG is currently disabled — always use GPIO bitbang.
    // SPI mode has known issues and is not ready for use.
    // In the future, this can be re-enabled: the mode will be configurable via
    // the web interface and persisted in NVS under MCU_INTERFACE_KEY ("SPI"/"GPIO").
    // When that time comes, restore the NVS read block below and remove this forced assignment.
    SPI_nGPIO = false;

    //set PA and PC for swd_jtag. They are mutual excluded: Either use PA or PC for swd_jtag.
    bool b_use_porta = false; //gbl_pa_cfg == PA_BMP_SWD_JTAG;
    bool b_use_portb = gbl_pb_cfg != PB_LOGICANALYZER;
    bool b_use_portc = (gbl_pc_cfg == PC_BMP_SWD_JTAG);
    bool b_use_portd = gbl_pd_cfg != PD_LOGICANALYZER;
    ESP_LOGI(TAG, "To set_cfga(), Using %s for SWD/JTAG, b_use_porta=%d, b_use_portc=%d", SPI_nGPIO ? "SPI" : "GPIO", b_use_porta, b_use_portc);
    /* Establish the safe inactive level while Port B is still disconnected,
     * then enable its output. set_cfga() preserves the SRESET bit. */
    set_sreset(false);
    //esp32jtag_common.h:esp_err_t set_cfga(bool use_portc, bool use_porta, bool njtag_swdio, bool swd_gpio);
    set_cfga(b_use_porta, b_use_portb, b_use_portc, b_use_portd, true, !SPI_nGPIO); // use_portc, not use_porta, swdio, SPI not gpio

    set_la_input_sel(false);
    start_background_tasks();
    if (g_board->has_lcd) {
        draw_port_cfg_info();
    }
    init_gpio_sw1_sw2();

_wait:

    char *disable_dap_val = NULL;
    bool disable_usb_dap = true;  /* default: disabled */
    if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &disable_dap_val) == ESP_OK && disable_dap_val) {
        disable_usb_dap = (strcmp(disable_dap_val, "1") == 0);
        free(disable_dap_val);
    }

    if (!disable_usb_dap) {
        xTaskCreate(cherry_dap_task, "cherry_dap_task", 4096, NULL, 5, NULL);
    } else {
        ESP_LOGI(TAG, "USB based CMSIS-DAP and COM port is disabled");
    }

    ESP_LOGI(TAG, "[APP] Free memory: %lu bytes", esp_get_free_heap_size());
    int loop_count = 0;
    uint8_t prev_screen = 0;
    while (true) {
        check_sw1_sw2();

        if (g_lcd_screen != prev_screen) {
            if (g_lcd_screen == 0 && g_board->has_lcd) {
                g_force_dbg_redraw = true;
                draw_main_screen();
            } else if (g_lcd_screen == 1 && g_board->has_lcd) {
                draw_pinout_screen();
            }
            prev_screen = g_lcd_screen;
        }

        /* Periodic updates on main screen */
        if (g_lcd_screen == 0) {
            if (g_app_params.mode == APP_MODE_AP && g_board->has_lcd) {
                print_sta_info();
            }
            draw_debug_status();
        }
        /* Redraw pinout screen only when port configs change */
        if (g_lcd_screen == 1 && g_board->has_lcd) {
            static uint8_t prev_cfgs[4];
            static uint8_t prev_pd_display = 0;
            uint8_t cur_cfgs[] = {gbl_pa_cfg, gbl_pb_cfg, gbl_pc_cfg, gbl_pd_cfg};
            if (cur_cfgs[0] != prev_cfgs[0] || cur_cfgs[1] != prev_cfgs[1] ||
                cur_cfgs[2] != prev_cfgs[2] || cur_cfgs[3] != prev_cfgs[3] ||
                gbl_pd_display_cfg != prev_pd_display) {
                draw_pinout_screen();
                for (int k = 0; k < 4; k++) prev_cfgs[k] = cur_cfgs[k];
                prev_pd_display = gbl_pd_display_cfg;
            }
        }

        if (++loop_count >= 15) {
            loop_count = 0;
            ESP_LOGI(TAG, "Free mem: %d %d",
                    heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                    heap_caps_get_free_size(MALLOC_CAP_DMA));
        }

        vTaskDelay(200 / portTICK_PERIOD_MS);
    }

    esp_restart();
}
